Revit 2027 API
VerticalTextAlignment Enumeration
 Supported types of vertical alignment of a text element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum VerticalTextAlignment
Public Enumeration VerticalTextAlignment
public enum class VerticalTextAlignment
type VerticalTextAlignment
Members
Member name | Value | Description
Bottom | 1 |  Bottom of the text box remains in place as the height of the text changes.
Middle | 2 |  The horizontal center line of the text box remains in place as the height of the text changes.
Top | 0 |  Top of the text box remains in place as the height of the text changes.
See Also
Reference
Autodesk.Revit.DB Namespace